diqiu114/CodeLib/STM32F10X_V01/Source/BAK/STM32_USB_V01.H
//==============================================================================================================================
#ifndef STM32_USB_V01_H
#define STM32_USB_V01_H
//==============================================================================================================================
#include "STM32F10X_V01.h"
//==============================================================================================================================
//<System_const.h>
#ifndef _SYSTEM_CONST_
#define _SYSTEM_CONST_

    //#define _DSP_COMMD_TEST_

    #define System_TestFlag

    #define ADC1_DR_Address                 ((u32)0x4001244C)

    #define __NET_FORMAT_USB_HID__      0x8080                  /* 用于定义协议栈的网络接口 */
    #define __NET_FORMAT_CAN__          0x9090
    #define __NET_FORMAT_USART__        0xa0a0

    #define __NET_FORMAT__    __NET_FORMAT_USB_HID__            /* 用于定义协议栈的网络接口 */

    #define __CAN_DIVER_ROUTE__         0xed3c                  /* CAN设备类型为路由设备 */
    #define __CAN_DIVER_NODE__          0xdec3                  /* CAN设备类型为节点设备 */
    #define __CAN_DIVER_TYPE__   __CAN_DIVER_ROUTE__            /* 定义当前CAN设备为路由设备 */



    #define SYSTEM_PILOT_LIGHT          GPIOB_Pin4_OUT
    #define SYSTEM_RUN_LIGHT            GPIOB_Pin5_OUT
    #define SYSTEM_ERR_LIGHT            GPIOB_Pin6_OUT
    
    #define SYSTEM_ENABLE_PIN               GPIOB_Pin8_OUT

    #define SYSTEM_INITIAL_CODE             0x5a5aa5a5
    #define SYSTEM_TEST_CODE                0x796845a5      // 测试机的运行代码
    #define SYSTEM_RUN_CODE                 0xf9453289      // 系统正常运行的代码

    #define __SYSTEM_BOOT__
    

    #define G16(X)  0x11021                 //CRC16校验多项式 X16+X12+x5+1

    #define LOCAL_CAN_ROUTE_ADDR            0x00a0          /* CAN路由节点地址 */
    #define LOCAL_CAN_ROUTE_ADDR_MIN        0x00a0
    #define LOCAL_CAN_ROUTE_ADDR_MAX        0x00af
    #define CAN_RADIO_ADDR                  0xffff          /* CAN广播地址 */
    #define USART_STACK_ADDR                0x0050          /* 总线上的串口地址 */
    #define USART_STACK_ROUTE_ADDR_MIN      0x0050
    #define USART_STACK_ROUTE_ADDR_MAX      0x005f

    typedef enum
    {
        FRAME_ERROR_HEADER  = 0x20,                         /* 没有找到数据头 */
        FRAME_ERROR_DATA_LENGTH = 0x21,                     /* 数据长度错误 */
        FRAME_ERROR_CAN_PACKET_LOSS = 0x22,                 /* CAN总线数据包丢失 */
        FRAME_ERROR_PACKET_LOSS = 0x23,                     /* 协议栈数据包丢失 */
        FRAME_ERROR_CHECK_SUM = 0x24,                       /* 校验和错误 */
        FRAME_ERROR_DEVICE_MAX = 0x25,                      /* 设备挂在数量超过总线极限 */
        FRAME_ERROR_DEVICE_ADDR = 0x26,                     /* 设备地址错误 */
        FRAME_ERROR_DEVICE_BUF_FULL = 0x27,                 /* 设备缓缓从区满 */
        FRAME_ERROR_DEVICE_OVER = 0x28,                     /* 设备地址超出设备缓冲区容量 */
    }ProtocolStack_Error_Enum;
    typedef enum
    {
        BASIC_COMMAND_HANDSHAKE = 0xa0,                     /* 设备握手 */
        BASIC_COMMAND_GET_DEVICE_INFO = 0xa1,               /* 获取设备信息 */
        BASIC_COMMAND_GET_DEVICE_PIDCODE = 0xa2,            /* 获取芯片PID码 */
        BASIC_COMMAND_GET_DEVICE_ADDR = 0xa3,               /* 获取can总线临时地址 */
        BASIC_COMMAND_SET_DEVICE_CAN_ADDR = 0xa4,           /* 复位设备 */
        BASIC_COMMAND_DEVIEC_AUTO_REQ_ADDR = 0xa5,          /* 自动请求CAN设备地址 */
        BASIC_COMMAND_PUBLIC_STAUTS = 0xa6,                 /* 公共状态命令 */
        BASIC_COMMAND_SYNC_TIME = 0xa7,                     /* 同步网络时间 */
        BASIC_COMMAND_INIT_NET = 0xa8,                      /* 网络初始化 */
        BASIC_COMMAND_GET_NODE_INFO = 0xa9,                 /* 获取节点功能 */
        BASIC_COMMAND_SET_NODE_INFO = 0xaa,                 /* 设置节点功能 */
        BASIC_COMMAND_DISABLE_NODE = 0xab,                  /* 禁止节点 */
        BASIC_COMMAND_ENABLE_NODE = 0xac,                   /* 使能节点 */
        BASIC_COMMAND_SET_PASSWORD = 0xad,                  /* 设置密码 */
        BASIC_COMMAND_HEART_FRAME = 0xae,                   /* 心跳帧 */
        BASIC_COMMAND_GET_NET_TYPE = 0xaf,                  /* 获取节点网络类型 */
        BASIC_COMMAND_DEVICE_ENROLLING = 0xb0,              /* 获取网络协议版本 */
        BASIC_COMMAND_DEVICE_ENROLLING_OK = 0xb2,           /* 设备注册通过 */

        BASIC_COMMAND_DEVICE_START_UPGRADE = 0xe0,          /* 设备进入升级状态 */
        BASIC_COMMAND_GET_DEVICE_SINFO = 0xe1,              /* 查询设备软件信息 */
        BASIC_COMMAND_GET_DEVICE_UP_ADDRES = 0xe2,          /* 查询升级地址 */
        BASIC_COMMAND_DEVICE_UPGRADE_INVC = 0xe3,           /* 升级设备向量区 */
        BASIC_COMMAND_GET_VEC_ADDR = 0xe4,                  /* 获取升级中断地址 */
        BASIC_COMMAND_GET_APP_ADDR = 0xe5,                  /* 获取升级应用地址 */
        BASIC_COMMAND_DEVICE_UPGRADE_APP = 0xe6,            /* 升级应用代码区 */
        BASIC_COMMAND_DEVICE_CONT_TRANS_ADDR = 0xe7,        /* 断点续传命令 */
        BASIC_COMMAND_DEVICE_UPGRADE_QUIT = 0xe8            /* 升级退出 */
    }BasicCommand_FrameNet;
    typedef enum
    {
        FRAMT_RADIO_ADDR    = 0xffff,                       /* 广播地址 */
        MAX_RECEIVE_DEVICE = 0x02,                          /* 最多可以容纳的设备通道数,MAX_RECEIVE_DEVICE用于HID,MAX_RECEIVE_DEVICE + 1用于串口总线 */
        MAX_RECEIVE_DEVICE_ADDR = MAX_RECEIVE_DEVICE << 1,  /* 地址列表地址长度 */
        HID_RECEVIE_INX = 0,
        WIFI_RECEVIE_INX = 1,
        USART_RECEVIE_INX = MAX_RECEIVE_DEVICE + 1,
        SYSETME_DEVICE_NUMBER = 0,                          /* 系统除去用于CAN通讯的其他通讯设备数量 */
        FRAME_RECEIVE_BUF_MAX    = 0x200,                   /* 协议包接收缓冲区空间大小 */
        FRAME_SEND_BUF_MAX = 0x0c0,                         /* 协议包发送缓冲区大小 */

        FRAMEFRAME_CONTROL_HEAD = 0x55aa,
        FRAME_FRAMEHEAD_SIZE = 0x02,
        FRAME_CONTWORD_SIZE = 0x03,
        FRAM_PASSWORD_SIZE = 0x08,                          /* 密码长度 */

        FRAME_HEAD_SIZE = FRAME_FRAMEHEAD_SIZE + FRAME_CONTWORD_SIZE,
        FRAM_CAN_SEND_MAX = 0x08,                           /* CAN最大一帧数据的长度 */
        FRAM_HID_SEND_MAX = 0x40,                           /* HID 的最大一帧数据的长度 */
        FRAM_WIFI_SEND_MAX = 0x40,                          /* WIFI能传输的最大一帧数据 */
        FRAME_ADDR_LENGTH = 0x01,                           /* 地址长度 */
        FRAME_DIVER_TYPE_HID = 0x50,                        /* 设备类型是HID */
        FRAME_DIVER_TYPE_CAN = 0x53,                        /* 设备类型是CAN */
        FRAME_DIVER_TYPE_USART = 0x59,                      /* 设备类型是USART */

