diqiu114/CodeLib/STM32F10X_V01/Source/BAK/STM32_USB_V01.H
        FRAME_NODE_TYPE_ROUTE = 0xc5,                       /* 节点类型是路由节点 */
        FRAME_NODE_TYPE_ENDPOINT = 0xb7,                    /* 节点类型是端点 */

        FRAME_NODE_ADDR_LENGTH = 0x02,                      /* 节点地址长度 */
    }ProtocolStack_Enum;

    typedef enum
    {
        UPCODE_STATUS_OK = 0,                   /* 操作OK */
        UPCODE_STATUS_ERR = 0x51,               /* 通讯协议数据包错误(头\长度\地址\操作......)*/
        UPCODE_STATUS_VER_ERR = 0x52,           /* 通讯协议数据包校验错误 */
        UPCODE_STATUS_CRC_ERR = 0x53,           /* CRC 错误*/
        UPCODE_STATUS_DEVICE_BUSY = 0x55,       /* 设备忙 */
        UPCODE_STATUS_CMMD_ERR = 0xa5,          /* 命令错误 */

        UPCODE_STATUS_PAK_ERR = 0x54,           /* 数据包丢包错误 */
        UPCODE_STATUS_ERASE_ERR = 0x55,         /* FLASH 擦除错误 */
        UPCODE_STATUS_PROGRAM_ERR = 0x56,       /* FLASH 编程错误 */
        UPCODE_STATUS_ADDR_ERR = 0x57,          /* 升级FLASH地址错误 */
        UPCODE_STATUS_DIVERADDR_ERR = 0x58,     /* 升级设备通讯地址错误*/

        UPCODE_QUIT_OK = 0x00,                  /* 升级正常退出 */
        UPCODE_QUIT_ERR = 0x61,                 /* 升级错误退出 */
        UPCODE_QUIT_NO_UPCODE = 0x62,           /* 没有做任何代码升级 */
        UPCODE_QUIT_FIRST_UPCODE = 0x82         /* 测试模拟第一次运行代码 */


    }UPCDE_ERR;
    //typedef enum
    //{

    #ifdef  __SYSTEM_BOOT__
        #define SYSTEM_NVIC_BOOT_ADDR                   ((unsigned long int)0x08000000)
        #define SYSTEM_NVIC_APP_ADDR                    ((unsigned long int)0x08011800)
    #else
        #define SYSTEM_NVIC_APP_ADDR                    ((unsigned long int)0x08000000)
    #endif

        #define UPCODE_BACKUP_BLOCK_START_ADDR  0x08008000   /* 备份块的起始地址 */
        #define UPCODE_BACKUP_BLOCK_END_ADDR  0x08011800     /* 备份块的结束地址 */
        #define UPCODE_SYSTEM_INVC_START_ADDR  0x08011800    /* 中断向量起始地址 */
        #define UPCODE_SYSTEM_INVC_END_ADDR  0x08012000      /* 中断向量的结束地址 */
        #define UPCODE_SYSTEM_APP_START_ADDR  0x08012000     /* 应用程序的起始地址 */
        #define UPCODE_SYSTEM_APP_END_ADDR  0x0801f000       /* 应用程序的结束地址*/
        #define UPCODE_SYSTEM_PRODUCT_START_ADDR  0x0801f800 /* 产品的备份地址 */
        #define UPCODE_SYSTEM_EDITION_START_ADDR  0x0801f900 /* 版本的备份地址 */
        #define UPCODE_SYSTEM_DATA_START_ADDR  0x0801fa00    /* 版本的备份地址 */
        #define UPCODE_FLASH_PAGE_SIZE_2K  0x0800            /* 芯片的页尺寸 */
        #define UPCODE_FLASH_PAGE_SIZE_1K  0x0400            /* 芯片的页尺寸 */
        #define UPCODE_FLASH_PAGE_INFO_1K  0x01              /* 芯片页尺寸1K */
        #define UPCODE_FLASH_PAGE_INFO_2K  0x02              /* 芯片页尺寸2K */
        #define UPCODE_FLASH_PROODUCT_LENTH  0x20            /* 产品字符长度 */

        #define UPCODE_EEPROM_HARDWARE_ADDR 0x0a0            /* IIC的硬件地址 */
        #define UPCODE_EEPROM_RUNCODE_FIRST_ADDR0 0x00       /* 升级运行状态码首地址 */
        #define UPCODE_EEPROM_RUNCODE_FIRST_ADDR1 0x01       /* 升级运行状态码首地址 */
        #define UPCODE_EEPROM_RUNCODE_FIRST_ADDR2 0x02       /* 升级运行状态码首地址 */
        #define UPCODE_EEPROM_RUNCODE_FIRST_ADDR3 0x03       /* 升级运行状态码首地址 */
        #define UPCODE_EEPROM_BAKPROGRAM_STATE_ADD0 0x04     /* 升级备份状态码首地址 */
        #define UPCODE_EEPROM_BAKPROGRAM_STATE_ADD1 0x05     /* 升级备份状态码首地址 */
        #define UPCODE_EEPROM_CAN_ID_ADDR0        0x06       /* 配置的CAN通讯ID地址高地址 */
        #define UPCODE_EEPROM_CAN_ID_ADDR1        0x07       /* 配置的CAN通讯ID地址低地址 */

        #define UPCODE_BAKPROGRAM_STATE_OK  0x85a5           /* 升级程序备份OK,可以使用备份区 */
        #define UPCODE_BAKPROGRAM_STATE_ERR 0xfa5a           /* 升级程序备份ERR,不可使用备份区 */

        #define UPCODE_SYTEM_STATE_FLASH_INX   0x08          /* 系统运行状态数据的存储位置 */
        #define UPCODE_INT_ADDR_STATE_INX  0x09              /* 系统用于存放中断编程地址的状态 */
        #define UPCODE_INT_ADDR_INX  0x0a                    /* 系统用于存放中断编程的地址值 */
        #define UPCODE_SYSTEM_EEROM_FIRST_RUN0  0xffffffff   /* EPROM第一次操作 */
        #define UPCODE_SYSTEM_EEROM_FIRST_RUN1  0x00000000   /* EPROM第一次操作 */
        #define UPCODE_SYSTEM_FIRST_RUN  0xee6633aa          /* 系统首次运行 */
        #define UPCODE_SYSTEM_STATE_NORMAL  0xddaacc55       /* 系统处于正常工作状态 */
        #define UPCODE_SYSTEM_STATE_UPGRADE  0x5a66a522      /* 系统处于升级状态 */
        #define UPCODE_SYSTEM_STATE_WRITE_CODE  0x85ef89b5   /* 系统处于升级状态的写代码状态 */
        #define UUCODE_INT_ADDR_STATE_NORMAL  0x55ccaadd     /* 系统处于正常运行状态 */
        #define UPCODE_INT_ADDR_STATE_ADDR  0xEFFEA55A       /* 系统处于编程中断,地址寄存器中存放的是中断地址 */
        #define UPCODE_SYSTEM_UPGRADE_ERR  0x99775aa5        /* 升级错误 */

        #define UPCODE_WAITING_TIME  0x168                   /* 进入升级模式后,UPCODE_WAITING_TIME这么多秒,如果还没有开始升级,就退出升级状态进入正常工作模式 */
        #define UPCODE_ERR_TIME  0x258                       /* 升级过程中遇到阻塞或者错误,等待10分钟后退出 */
        #define UPCODE_REPEATS_VALUE  0x0a                   /* 编程最大重复错误次数 */

        #define FLASH_WRITE_DATA_LENTH  0x0c
        #define FLASH_WRITE_INX_VAR  0x0b
        #define FLASH_WRITE_FLAG_VAR  0x5a5aa5a5

    //}UpCode_System;

/* 以下为具体产品的协议 */
    typedef enum
    {
        TP_PEDAL_PVID_CODE = 0x20,                           /* 踏板虚拟ID */
        CONTROL_PEADL_PVID_CODE = 0x30,                      /* 控台板虚拟ID */
        IO_PEDAL_PVID_CODE = 0x40,                           /* IO板虚拟ID */
        RADIO_PVID_CODE = 0xff,                              /* 虚拟的广播ID */
    }SYSTEM_HARDWARE_PVID_ENUM;
    typedef enum 
    {
        DONCE_STATUS_KEY = 0xe0,                            /* 游戏状态 */
        PC_GET_RESOURCE_PUBLIC_KEY = 0xea,                  /* PC获取资源公钥 */
    }SYSTEM_COMMD_ENUM;
    typedef enum
    {
        PEDAL_DEIVER_CODE_RIGHT_UP = 0x02005,
        PEDAL_DEIVER_CODE_LEFT_UP = 0x02001,
        PEDAL_DEIVER_CODE_MIDDLE = 0x02003,
        PEDAL_DEIVER_CODE_RIGHT_DN = 0x02004,
        PEDAL_DEIVER_CODE_LEFT_DN = 0x02002,
    }Pedal_DeiverCode;
    
    #define KEY_PRESSTIME                   5                /*按键防抖*/
    #define KEY_DOWNCODE                    0x00
    #define KEY_UPCODE                      0x01
    #define KEY_DOWNDOWNCODE                0x02
    #define KEY_NUMBER_MAX                  0x05
		
		#define PC_PACK_MAX_LEN                 10
		#define A7196_PACK_MAX_LEN	                200
		
				#define StartAddr  ((unsigned long int )0x0800C000)

#define ADC_SWITCH0_Addr  ((unsigned long int )0x0800C000)
#define A7196_CHANNEL_Addr  ((unsigned long int )0x0800C000)	
#endif
//------------------------------------------------------------------------------------------------------------------------------

//<Staruct.h>
    typedef struct
    {
        struct
        {
            unsigned long int System_1msFlag_On:1;
            unsigned long int System_Int_Event_Flag_On:1;
            unsigned long int System_Imd_Event_Flag_On:1;
            unsigned long int IIC_Error_Flag:1;
            unsigned long int System_Init_Flag:1;                       /* 系统初始化 */
            unsigned long int ReceiverData_Pack_Ok:1;                   /* 数据包准备好标志 */
            unsigned long int SendData_DlayTime_Flag:1;                 /* 延迟数据发送标志 */
            unsigned long int UartStart_SendData_Flag:1;                /* USART开始发送数据标志 */
            unsigned long int System_Verification_OK:1;                 /* 验证通过标志 */
            unsigned long int HID_Init_OK_Flag:1;                       /* HID 初始化完成 */
            unsigned long int PassWord_Settings_Flag:1;                 /* 密码被设置的标志位 */
            unsigned long int System_Blue_Receive_OK_Flag:1;            /* 蓝牙接收数据OK标志 */
            unsigned long int System_Blue_Commd_OK_Flag:1;              /* 蓝牙命令接收OK标志 */
					  unsigned long int Pack_Received:1;
        }Bit;

