diqiu114/CodeLib/STM32F10X_V01/Source/BAK/STM32_USB_V01.H
        unsigned char Music_Vol;                                        /* 系统音乐音量 */
        unsigned char Phone_Vol;                                        /* 系统耳机音量 */
        unsigned char Diver_NodeType;                                   /* 设备类型 */
        unsigned char Password_Val[FRAM_PASSWORD_SIZE];                 /* 存放密码的缓冲区 */
        unsigned short int Destination_CanAddr;                         /* 目标机地址 */
        unsigned short int Local_CanAddr;                               /* 本机Can地址接收器 */
        unsigned short int PowerTime;                                   /* 延时开机定时器 */
        unsigned short int Frame_OverTime;                              /* 用于系统协议帧超时计数 */
        unsigned short int System_WorkMode_Code;                        /* 系统工作状态码 */
        unsigned short int TransmitterAddr_List[MAX_RECEIVE_DEVICE + 1];/* 动态设备地址列表,首地址存放的是一共有多少设备挂在到设备上,最终设备列表将存放到EPROM中 */
        unsigned long int DiverFrame_Receive_OK;                        /* 器件接收OK的标志 最多支持32个设备 */
        unsigned long int DiverFrame_Receive_Error;                     /* 器件接收错误的标志 最多支持32个设备 */
        unsigned long int StackCommand_Flag;
        unsigned long int FrameCommand_Flag;
        unsigned long int DelayTime;
				unsigned long int LED1_TimeCount;
    }System_Struct;

    typedef struct
    {
        struct
        {
            unsigned long int System_Boot_1msFlag_On:1;         /* 用于升级程序的核心程序 */
            unsigned long int System_Boot_Int_Event_Flag_On:1;
            unsigned long int System_Boot_Imd_Event_Flag_On:1;
            unsigned long int SendData_Boot_DlayTime_Flag:1;    /* 延迟数据发送标志 */
            unsigned long int HID_Init_OK_Boot_Flag:1;          /* HID 初始化完成 */
            unsigned long int IIC_Error_Boot_Flag:1;
            unsigned long int Up_StartUp_Flag_On:1;
            unsigned long int Up_Over_Flag_On:1;
            unsigned long int Up_Error_Flag_On:1;
            unsigned long int Up_OK_Flag_On:1;
            unsigned long int Up_Moede_On:1;
            unsigned long int Up_DlayTime_Flag_On:1;
            unsigned long int Up_Online_OK_Flag:1;
            unsigned long int Up_Continue_Trans_Flag:1;         /* 中断续传标志 */
            unsigned long int Up_StartTrans_IntVecCode_Flag:1;  /* 开始传输代码 */
            unsigned long int Up_StartTrans_AppCode_Flag:1;     /* 开始传输代码 */
        }Bit;
        unsigned long int DiverFrame_Boot_Receive_OK;           /* 器件接收OK的标志 最多支持32个设备 */
        unsigned long int DiverFrame_Boot_Receive_Error;        /* 器件接收错误的标志 最多支持32个设备 */
        unsigned long int StackCommand_Boot_Flag;
        unsigned long int FrameCommand_Boot_Flag;
        unsigned long int System_RunningState_Code;             /* 运行状态寄存器 */
        unsigned long int UpGram_Addr;                          /* 编程地址 */
        unsigned long int UpGram_ContTrans_Addr;                /* 续传地址 */
        unsigned long int UpGram_Code_Lenth;                    /* 下发的代码长度 */
        unsigned long int TimeVal;
        unsigned short int Frame_Boot_OverTime;
        unsigned short int Packet_No;
        unsigned short int Packet_No_Bak;
        unsigned short int MaxPacket_No;
        unsigned short int Packet_CRC;
        unsigned short int Local_CanAddr;                       /* 本机Can地址接收器 */
        unsigned char Diver_NodeType;                           /* 设备类型 */
        unsigned char DelayTime;                                /* 用于HID发送数据延迟 */
        unsigned char Packet_Length;
        unsigned char UpGram_Err_Count;                         /* 升级错误计数 */
        unsigned char SendBuf[FRAME_SEND_BUF_MAX];
    }Upgram_Struct;




//------------------------------------------------------------------------------------------------------------------------------
//<USBFS.h>
//<usb_core.h>
typedef struct OneDescriptor
{
  UINT8 *Descriptor;
  UINT16 Descriptor_Size;
}
ONE_DESCRIPTOR, *PONE_DESCRIPTOR;
// All the request process routines return a value of this type   If the return value is not SUCCESS or NOT_READY,  the software will STALL the correspond endpoint 

// When send data out of the device,CopyData() is used to get data buffer 'Length' bytes data
//if Length is 0, CopyData() returns the total length of the data
//if the request is not supported, returns 0  (NEW Feature )
//if CopyData() returns -1, the calling routine should not proceed further and will resume the SETUP process by the class device
//if Length is not 0, CopyData() returns a pointer to indicate the data location Usb_wLength is the data remain to be sent,
// Usb_wOffset is the Offset of original data When receive data from the host,
// CopyData() is used to get user data buffer which is capable  of Length bytes data to copy data from the endpoint buffer.
//if Length is 0, CopyData() returns the available data length,
//if Length is not 0, CopyData() returns user buffer address  Usb_rLength is the data remain to be received,  Usb_rPointer is the Offset of data buffer
typedef struct _ENDPOINT_INFO
{
  uint16_t  Usb_wLength;
  uint16_t  Usb_wOffset;
  uint16_t  PacketSize;
  uint8_t   *(*CopyData)(uint16_t Length);
}ENDPOINT_INFO;

typedef struct _DEVICE
{
  uint8_t Total_Endpoint;     //Number of endpoints that are used
  uint8_t Total_Configuration;//Number of configuration available
}DEVICE;

typedef union
{
  uint16_t w;
  struct BW
  {
    uint8_t bb1;
    uint8_t bb0;
  }
  bw;
} uint16_t_uint8_t;

typedef struct _DEVICE_INFO
{
  uint8_t USBbmRequestType; //bmRequestType
  uint8_t USBbRequest;            //bRequest
  uint16_t_uint8_t USBwValues;         //wValue
  uint16_t_uint8_t USBwIndexs;         //wIndex
  uint16_t_uint8_t USBwLengths;        //wLength

  uint8_t ControlState;           //USB_CONTROL_STATE
  uint8_t Current_Feature;
  uint8_t Current_Configuration;   //Selected configuration  //CONFIGURATION是怎么取值的，代表什么意义？
  uint8_t Current_Interface;       //Selected interface of current configuration 
  uint8_t Current_AlternateSetting;//Selected Alternate Setting of current interface

  ENDPOINT_INFO Ctrl_Info;
}DEVICE_INFO;

