diqiu114/CodeLib/STM32F10X_V01/Source/BAK/STM32_USB_V01.H
typedef struct _DEVICE_PROP
{
  void (*Init)(void);        //Initialize the device
  void (*Reset)(void);       //Reset routine of this device

  //Device dependent process after the status stage
  void (*Process_Status_IN)(void);
  void (*Process_Status_OUT)(void);

  //Procedure of process on setup stage of a class specified request with data stage\
    All class specified requests with data stage are processed in Class_Data_Setup Class_Data_Setup()\
    responses to check all special requests and fills ENDPOINT_INFO  according to the request\
    If IN tokens are expected, then wLength & wOffset will be filled  with the total transferring bytes and the starting position\
    If OUT tokens are expected, then rLength & rOffset will be filled  with the total expected bytes and the starting position in the buffer\
    If the request is valid, Class_Data_Setup returns SUCCESS, else UNSUPPORT CAUTION:\
    Since GET_CONFIGURATION & GET_INTERFACE are highly related to the individual classes, they will be checked and processed here.
  
  USB_RESULT (*Class_Data_Setup)(uint8_t RequestNo);

  //Procedure of process on setup stage of a class specified request without data stage \
    All class specified requests without data stage are processed in Class_NoData_Setup  Class_NoData_Setup\
    responses to check all special requests and perform the request  CAUTION:\
    Since SET_CONFIGURATION & SET_INTERFACE are highly related to the individual classes, they will be checked and processed here.
  
  USB_RESULT (*Class_NoData_Setup)(uint8_t RequestNo);

  //Class_Get_Interface_Setting This function is used by the file usb_core.c to test if the selected Interface\
    and Alternate Setting (uint8_t Interface, uint8_t AlternateSetting) are supported by  the application.\
    This function is writing by user. It should return "SUCCESS" if the Interface\
    and Alternate Setting are supported by the application or "UNSUPPORT" if they  are not supported.

  USB_RESULT (*Class_Get_Interface_Setting)(uint8_t Interface, uint8_t AlternateSetting);

  uint8_t* (*GetDeviceDescriptor)(uint16_t Length);
  uint8_t* (*GetConfigDescriptor)(uint16_t Length);
  uint8_t* (*GetStringDescriptor)(uint16_t Length);

  //This field is not used in current library version. It is kept only for compatibility with previous versions
  void* RxEP_buffer;
  uint8_t MaxPacketSize;
}DEVICE_PROP;

typedef struct _USER_STANDARD_REQUESTS
{
  void (*User_GetConfiguration)(void);       //Get Configuration
  void (*User_SetConfiguration)(void);       // Set Configuration
  void (*User_GetInterface)(void);           // Get Interface
  void (*User_SetInterface)(void);           // Set Interface
  void (*User_GetStatus)(void);              // Get Status
  void (*User_ClearFeature)(void);           // Clear Feature
  void (*User_SetEndPointFeature)(void);     // Set Endpoint Feature
  void (*User_SetDeviceFeature)(void);       // Set Device Feature
}
USER_STANDARD_REQUESTS;

#define Type_Recipient (pInformation->USBbmRequestType & (REQUEST_TYPE | RECIPIENT))

#define Usb_rLength Usb_wLength
#define Usb_rOffset Usb_wOffset

#define USBwValue USBwValues.w
#define USBwValue0 USBwValues.bw.bb0
#define USBwValue1 USBwValues.bw.bb1
#define USBwIndex USBwIndexs.w
#define USBwIndex0 USBwIndexs.bw.bb0
#define USBwIndex1 USBwIndexs.bw.bb1
#define USBwLength USBwLengths.w
#define USBwLength0 USBwLengths.bw.bb0
#define USBwLength1 USBwLengths.bw.bb1

uint8_t Setup0_Process(void);
uint8_t Post0_Process(void);
uint8_t Out0_Process(void);
uint8_t In0_Process(void);

USB_RESULT Standard_SetEndPointFeature(void);
USB_RESULT Standard_SetDeviceFeature(void);

uint8_t *Standard_GetConfiguration(uint16_t Length);
USB_RESULT Standard_SetConfiguration(void);
uint8_t *Standard_GetInterface(uint16_t Length);
USB_RESULT Standard_SetInterface(void);
uint8_t *Standard_GetDescriptorData(uint16_t Length, PONE_DESCRIPTOR pDesc);

uint8_t *Standard_GetStatus(uint16_t Length);
USB_RESULT Standard_ClearFeature(void);
void NOP_Process(void);

extern  DEVICE_PROP Device_Property;
extern  USER_STANDARD_REQUESTS User_Standard_Requests;
extern  DEVICE  Device_Table;
extern  DEVICE_INFO Device_Info;

/* cells saving status during interrupt servicing */
//extern uint16_t SaveRState,SaveTState;

#define ValBit(VAR,Place)    (VAR & (1 << Place))
#define SetBit(VAR,Place)    (VAR |= (1 << Place))
#define ClrBit(VAR,Place)    (VAR &= ((1 << Place) ^ 255))

#ifdef STM32F10X_CL
 #define SendZeroLength()  {PCD_EP_Write (0, 0, 0) ; DUSB.TXSTAT=USB_EPR_STAT_VALID;}//SaveTState=EP_TX_VALID;
#else
  #define SendZeroLength() {USB.CH[0].TXCOUNT=0x00; DUSB.TXSTAT=USB_EPR_STAT_VALID;}//SaveTState=EP_TX_VALID;
#endif


#define StatusInfo0 StatusInfo.bw.bb1//Reverse bb0 & bb1
#define StatusInfo1 StatusInfo.bw.bb0

static void DataStageOut(void);
static void DataStageIn(void);
static void NoData_Setup0(void);
static void Data_Setup0(void);
//------------------------------------------------------------------------------------------------------------------------------
//<usb_def.h>
typedef enum _RECIPIENT_TYPE
{
  DEVICE_RECIPIENT,     //Recipient device
  INTERFACE_RECIPIENT,  //Recipient interface
  ENDPOINT_RECIPIENT,   //Recipient endpoint
  OTHER_RECIPIENT
} RECIPIENT_TYPE;

typedef enum _STANDARD_REQUESTS
{
  GET_STATUS = 0,
  CLEAR_FEATURE,
  RESERVED1,
  SET_FEATURE,
  RESERVED2,
  SET_ADDRESS,
  GET_DESCRIPTOR,
  SET_DESCRIPTOR,
  GET_CONFIGURATION,
  SET_CONFIGURATION,
  GET_INTERFACE,
  SET_INTERFACE,
  TOTAL_sREQUEST,  //Total number of Standard request
  SYNCH_FRAME = 12
} STANDARD_REQUESTS;

//Definition of "USBwValue"
typedef enum _DESCRIPTOR_TYPE
{
  DEVICE_DESCRIPTOR = 1,
  CONFIG_DESCRIPTOR,
  STRING_DESCRIPTOR,
  INTERFACE_DESCRIPTOR,
  ENDPOINT_DESCRIPTOR
} DESCRIPTOR_TYPE;

//Feature selector of a SET_FEATURE or CLEAR_FEATURE
typedef enum _FEATURE_SELECTOR
{
  ENDPOINT_STALL,
  DEVICE_REMOTE_WAKEUP
} FEATURE_SELECTOR;

//Definition of "USBbmRequestType"
#define REQUEST_TYPE      0x60  //Mask to get request type
#define STANDARD_REQUEST  0x00  //Standard request
#define CLASS_REQUEST     0x20  //Class request
#define VENDOR_REQUEST    0x40  //Vendor request

#define RECIPIENT         0x1F  //Mask to get recipient
//------------------------------------------------------------------------------------------------------------------------------
//<usb_init.h>
void USB_Init(void);
//extern uint8_t	EPindex;
extern DEVICE_INFO*	pInformation;
extern DEVICE_PROP*	pProperty;
extern USER_STANDARD_REQUESTS *pUser_Standard_Requests;
extern uint16_t	SaveState ;
extern uint16_t wInterrupt_Mask;
//------------------------------------------------------------------------------------------------------------------------------
//<usb_int.h>
void CTR_LP(void);
void CTR_HP(void);
//------------------------------------------------------------------------------------------------------------------------------
//<usb_type.h>
#ifndef NULL
#define NULL ((void *)0)
#endif

#if !defined (__STM32F10x_H) && !defined(__STM32L1XX_H)
#if 0
typedef signed long      s32;
typedef signed short     s16;
typedef signed char      s8;

typedef volatile signed long      vs32;
typedef volatile signed short     vs16;
typedef volatile signed char      vs8;

typedef unsigned long       u32;
typedef unsigned short      u16;
typedef unsigned char       u8;

