diqiu114/CodeLib/STM32F10X_V01/Source/BAK/STM32_USB_V01.H
typedef unsigned long  const    uc32;  /* Read Only */
typedef unsigned short const    uc16;  /* Read Only */
typedef unsigned char  const    uc8;   /* Read Only */

typedef volatile unsigned long      vu32;
typedef volatile unsigned short     vu16;
typedef volatile unsigned char      vu8;

typedef volatile unsigned long  const    vuc32;  /* Read Only */
typedef volatile unsigned short const    vuc16;  /* Read Only */
typedef volatile unsigned char  const    vuc8;   /* Read Only */

typedef enum { RESET = 0, SET   = !RESET } FlagStatus, ITStatus;

typedef enum { ERROR = 0, SUCCESS  = !ERROR} ErrorStatus;
#endif
#endif /* __STM32F10x_H && __STM32L15x_H */

//------------------------------------------------------------------------------------------------------------------------------
//<USB.H>
//<hw_config.h>
void Set_System(void);
void Set_USBClock(void);
void GPIO_AINConfig(void);
//void TIM_Configuration(void);
//void NVIC_Configuration(void);
void Enter_LowPowerMode(void);
void Leave_LowPowerMode(void);
void USB_Interrupts_Config(unsigned char UsbModule);
void Get_SerialNum(void);

extern System_Struct System_Markf;
//------------------------------------------------------------------------------------------------------------------------------
#define USB_DEVICE_DESCRIPTOR_TYPE              0x01
#define USB_CONFIGURATION_DESCRIPTOR_TYPE       0x02
#define USB_STRING_DESCRIPTOR_TYPE              0x03
#define USB_INTERFACE_DESCRIPTOR_TYPE           0x04
#define USB_ENDPOINT_DESCRIPTOR_TYPE            0x05

#define HID_DESCRIPTOR_TYPE                      0x21
#define CUSTOMHID_SIZ_HID_DESC                   0x09
#define CUSTOMHID_OFF_HID_DESC                   0x12

#define CUSTOMHID_SIZ_DEVICE_DESC                18
#define CUSTOMHID_SIZ_CONFIG_DESC                41
#define CUSTOMHID_SIZ_REPORT_DESC                33	//原鼠标74
#define CUSTOMHID_SIZ_STRING_LANGID              4
#define CUSTOMHID_SIZ_STRING_VENDOR              40		//原鼠标36
#define CUSTOMHID_SIZ_STRING_PRODUCT             32		//原鼠标70
#define CUSTOMHID_SIZ_STRING_SERIAL              26		//原鼠标26

#define STANDARD_ENDPOINT_DESC_SIZE             0x09

/* Exported functions ------------------------------------------------------- */
extern const uint8_t CustomHID_DeviceDescriptor[CUSTOMHID_SIZ_DEVICE_DESC];
extern const uint8_t CustomHID_ConfigDescriptor[CUSTOMHID_SIZ_CONFIG_DESC];
extern const uint8_t CustomHID_ReportDescriptor[CUSTOMHID_SIZ_REPORT_DESC];
extern const uint8_t CustomHID_StringLangID[CUSTOMHID_SIZ_STRING_LANGID];
extern const uint8_t CustomHID_StringVendor[CUSTOMHID_SIZ_STRING_VENDOR];
extern const uint8_t CustomHID_StringProduct[CUSTOMHID_SIZ_STRING_PRODUCT];
extern uint8_t CustomHID_StringSerial[CUSTOMHID_SIZ_STRING_SERIAL];
//------------------------------------------------------------------------------------------------------------------------------
//<usb_istr.h>
#if  !IsDensity(CL)
 void USB_Istr(void);
#else 
 UINT32 STM32_PCD_OTG_ISR_Handler(void);
#endif
//------------------------------------------------------------------------------------------------------------------------------
//<usb_prop.h>
extern System_Struct System_Markf;
typedef enum _HID_REQUESTS
{
  GET_REPORT = 1,
  GET_IDLE,
  GET_PROTOCOL,

  SET_REPORT = 9,
  SET_IDLE,
  SET_PROTOCOL
} HID_REQUESTS;

void CustomHID_Init(void);
void CustomHID_Reset(void);
void CustomHID_SetConfiguration(void);
void CustomHID_Status_In (void);
void CustomHID_Status_Out (void);

USB_RESULT CustomHID_Data_Setup(uint8_t);
USB_RESULT CustomHID_NoData_Setup(uint8_t);
USB_RESULT CustomHID_Get_Interface_Setting(uint8_t Interface, uint8_t AlternateSetting);
uint8_t *CustomHID_GetDeviceDescriptor(uint16_t );
uint8_t *CustomHID_GetConfigDescriptor(uint16_t);
uint8_t *CustomHID_GetStringDescriptor(uint16_t);
USB_RESULT CustomHID_SetProtocol(void);
uint8_t *CustomHID_GetProtocolValue(uint16_t Length);
USB_RESULT CustomHID_SetProtocol(void);
uint8_t *CustomHID_GetReportDescriptor(uint16_t Length);
uint8_t *CustomHID_GetHIDDescriptor(uint16_t Length);

#define CustomHID_GetConfiguration          NOP_Process
#define CustomHID_GetInterface              NOP_Process
#define CustomHID_SetInterface              NOP_Process
#define CustomHID_GetStatus                 NOP_Process
#define CustomHID_ClearFeature              NOP_Process
#define CustomHID_SetEndPointFeature        NOP_Process
#define CustomHID_SetDeviceFeature          NOP_Process
#define REPORT_DESCRIPTOR                  0x22
//------------------------------------------------------------------------------------------------------------------------------
//<usb_pwr.h>
void Suspend(void);
void Resume_Init(void);
void USB_Resume(USB_RESUME_STATE eResumeSetVal);
void USB_PowerOn(void);
void USB_PowerOff(void);
//------------------------------------------------------------------------------------------------------------------------------
extern System_Struct System_Markf;

void USB_ReadBUF(UINT8 EPIndex);
void USB_SendBUF(UINT8 EPIndex);
void USB_StartSend(void);
void USB_EndSend(void);
void USB_WaitSend(void);//等待发送完毕（中断外调用）,超时1秒
void USB_SendString_HW(UINT8 *s,UINT16 Len);//发送到硬件（中断外调用）
void USB_SendString(UINT8 *s,UINT16 Len);//发送到队列（中断外调用）
void USB_TXTimeOut_Timer(void);//every 100us,send timeout control;
void USB_Send_IMM(void);
//------------------------------------------------------------------------------------------------------------------------------
#if IsDensity(CL)
 #include "otgd_fs_cal.h"
 #include "otgd_fs_pcd.h"
 #include "otgd_fs_dev.h"
 #include "otgd_fs_int.h"
#endif
//==============================================================================================================================
#endif
//==============================================================================================================================
